balazsgrill/modembed/res/Devices/dsPIC33/PIC24HJ128GP504.PIC
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnnnnnnnnnn" edc:cname="AD1PCFGL" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0000000000000" edc:name="AD1PCFGL" edc:nzwidth="0x10" edc:por="---0000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="ADPCFG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCFG0" edc:desc="" edc:mask="0x1" edc:name="PCFG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG1" edc:desc="" edc:mask="0x1" edc:name="PCFG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG2" edc:desc="" edc:mask="0x1" edc:name="PCFG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG3" edc:desc="" edc:mask="0x1" edc:name="PCFG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG4" edc:desc="" edc:mask="0x1" edc:name="PCFG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG5" edc:desc="" edc:mask="0x1" edc:name="PCFG5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG6" edc:desc="" edc:mask="0x1" edc:name="PCFG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG7" edc:desc="" edc:mask="0x1" edc:name="PCFG7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG8" edc:desc="" edc:mask="0x1" edc:name="PCFG8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG9" edc:desc="" edc:mask="0x1" edc:name="PCFG9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG10" edc:desc="" edc:mask="0x1" edc:name="PCFG10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG11" edc:desc="" edc:mask="0x1" edc:name="PCFG11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG12" edc:desc="" edc:mask="0x1" edc:name="PCFG12" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnnnnnnnnnn" edc:cname="AD1CSSL" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0000000000000" edc:name="AD1CSSL" edc:nzwidth="0x10" edc:por="---0000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSS0" edc:desc="" edc:mask="0x1" edc:name="CSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS1" edc:desc="" edc:mask="0x1" edc:name="CSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS2" edc:desc="" edc:mask="0x1" edc:name="CSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS3" edc:desc="" edc:mask="0x1" edc:name="CSS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS4" edc:desc="" edc:mask="0x1" edc:name="CSS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS5" edc:desc="" edc:mask="0x1" edc:name="CSS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS6" edc:desc="" edc:mask="0x1" edc:name="CSS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS7" edc:desc="" edc:mask="0x1" edc:name="CSS7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS8" edc:desc="" edc:mask="0x1" edc:name="CSS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS9" edc:desc="" edc:mask="0x1" edc:name="CSS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS10" edc:desc="" edc:mask="0x1" edc:name="CSS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS11" edc:desc="" edc:mask="0x1" edc:name="CSS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSS12" edc:desc="" edc:mask="0x1" edc:name="CSS12" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------------nnn" edc:cname="AD1CON4" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------000" edc:name="AD1CON4" edc:nzwidth="0x10" edc:por="-------------000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMABL" edc:desc="" edc:mask="0x7" edc:name="DMABL" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DMABL0" edc:desc="" edc:mask="0x1" edc:name="DMABL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMABL1" edc:desc="" edc:mask="0x1" edc:name="DMABL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMABL2" edc:desc="" edc:mask="0x1" edc:name="DMABL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="76"/>
        <edc:SFRDef edc:access="nnnnn-----nn--nn" edc:cname="DMA0CON" edc:desc="" edc:impl="0xf833" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-----00--00" edc:name="DMA0CON" edc:nzwidth="0x10" edc:por="00000-----00--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AMODE" edc:desc="" edc:mask="0x3" edc:name="AMODE" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="NULLW" edc:desc="" edc:mask="0x1" edc:name="NULLW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HALF" edc:desc="" edc:mask="0x1" edc:name="HALF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIR" edc:desc="" edc:mask="0x1" edc:name="DIR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1" edc:name="SIZE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHEN" edc:desc="" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AMODE0" edc:desc="" edc:mask="0x1" edc:name="AMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMODE1" edc:desc="" edc:mask="0x1" edc:name="AMODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="s--------nnnnnnn" edc:cname="DMA0REQ" edc:desc="" edc:impl="0x807f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--------0000000" edc:name="DMA0REQ" edc:nzwidth="0x10" edc:por="0--------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IRQSEL" edc:desc="" edc:mask="0x7f" edc:name="IRQSEL" edc:nzwidth="0x7"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="FORCE" edc:desc="" edc:mask="0x1" edc:name="FORCE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IRQSEL0" edc:desc="" edc:mask="0x1" edc:name="IRQSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL1" edc:desc="" edc:mask="0x1" edc:name="IRQSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL2" edc:desc="" edc:mask="0x1" edc:name="IRQSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL3" edc:desc="" edc:mask="0x1" edc:name="IRQSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL4" edc:desc="" edc:mask="0x1" edc:name="IRQSEL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL5" edc:desc="" edc:mask="0x1" edc:name="IRQSEL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL6" edc:desc="" edc:mask="0x1" edc:name="IRQSEL6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA0STA" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA0STA" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="STA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA0STB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA0STB" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STB" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="STB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA0PAD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA0PAD" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PAD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PAD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA0CNT" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA0CNT" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-----nn--nn" edc:cname="DMA1CON" edc:desc="" edc:impl="0xf833" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-----00--00" edc:name="DMA1CON" edc:nzwidth="0x10" edc:por="00000-----00--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AMODE" edc:desc="" edc:mask="0x3" edc:name="AMODE" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="NULLW" edc:desc="" edc:mask="0x1" edc:name="NULLW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HALF" edc:desc="" edc:mask="0x1" edc:name="HALF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIR" edc:desc="" edc:mask="0x1" edc:name="DIR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1" edc:name="SIZE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHEN" edc:desc="" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AMODE0" edc:desc="" edc:mask="0x1" edc:name="AMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMODE1" edc:desc="" edc:mask="0x1" edc:name="AMODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="s--------nnnnnnn" edc:cname="DMA1REQ" edc:desc="" edc:impl="0x807f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--------0000000" edc:name="DMA1REQ" edc:nzwidth="0x10" edc:por="0--------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IRQSEL" edc:desc="" edc:mask="0x7f" edc:name="IRQSEL" edc:nzwidth="0x7"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="FORCE" edc:desc="" edc:mask="0x1" edc:name="FORCE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IRQSEL0" edc:desc="" edc:mask="0x1" edc:name="IRQSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL1" edc:desc="" edc:mask="0x1" edc:name="IRQSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL2" edc:desc="" edc:mask="0x1" edc:name="IRQSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL3" edc:desc="" edc:mask="0x1" edc:name="IRQSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL4" edc:desc="" edc:mask="0x1" edc:name="IRQSEL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL5" edc:desc="" edc:mask="0x1" edc:name="IRQSEL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL6" edc:desc="" edc:mask="0x1" edc:name="IRQSEL6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA1STA" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA1STA" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="STA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
